In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=['Name', 'height'])
df

Empty DataFrame
Columns: [Name, height]
Index: []

In [30]:
df.loc[0] = ['Allen', '175']

In [31]:
df

    Name   height
0  Allen      175
1    Ted  kkkkkkk

In [32]:
df.loc[1] = ['Ted', '180']
df

    Name height
0  Allen    175
1    Ted    180

In [9]:
df.loc[1]

Name      Ted
height    180
Name: 1, dtype: object

In [12]:
df['Weight'] = ['75', '80']

In [13]:
df

    Name height Weight
0  Allen    175     75
1    Ted    180     80

In [14]:
df.drop(['Weight'], axis=1)

    Name height
0  Allen    175
1    Ted    180

In [16]:
df = df.drop(['Weight'], axis=1)

In [17]:
df

    Name height
0  Allen    175
1    Ted    180

In [18]:
df.drop(1)

    Name height
0  Allen    175

In [19]:
df

    Name height
0  Allen    175
1    Ted    180

In [20]:
df = df.drop(1)

In [21]:
df

    Name height
0  Allen    175

In [22]:
df.loc[1] = ['Ted', '180']

In [23]:
df

    Name height
0  Allen    175
1    Ted    180

In [24]:
df['height'][0] = '180'

In [25]:
df

    Name height
0  Allen    180
1    Ted    180

In [26]:
df2 = df
df2

    Name height
0  Allen    180
1    Ted    180

In [27]:
df2.loc[0] = 5555
df2

   Name height
0  5555   5555
1   Ted    180

In [29]:
df['height'] = 'kkkkkkk'
df

   Name   height
0  5555  kkkkkkk
1   Ted  kkkkkkk

In [33]:
df

    Name height
0  Allen    175
1    Ted    180

In [36]:
df.to_csv('./test_pandas.csv', index=False, encoding='utf-8')

In [38]:
pd.read_csv('./test_pandas.csv', encoding='utf-8')

    Name  height
0  Allen     175
1    Ted     180